docs/bane-dominion-expansion.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://mjgpy3.github.io/me/rss.xml"
      title="RSS feed for https://mjgpy3.github.io/me">
<title>Bane Dominion Expansion</title>
<meta name="author" content="Michael 'Gilli' Gilliland">
<meta name="referrer" content="no-referrer">
<link href= "static/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="https://mjgpy3.github.io/me">Gilli's Land</a>
</div></div>
<div id="content">
<div class="post-date">08 Apr 2022</div><h1 class="post-title"><a href="https://mjgpy3.github.io/me/bane-dominion-expansion.html">Bane Dominion Expansion</a></h1>

<div id="outline-container-org80faad0" class="outline-2">
<h2 id="org80faad0">Why Bane?</h2>
<div class="outline-text-2" id="text-org80faad0">
<p>
I created a <a href="https://www.riograndegames.com/games/dominion/">dominion</a> expansion based around the <a href="http://wiki.dominionstrategy.com/index.php/Bane">Young Witch's bane card</a>.
</p>

<p>
The reason for using "Bane" (e.g. deck modifiers) as the main deck engine is simple. You can print the cards out (using a tool like <a href="https://shardofhonor.github.io/dominion-card-generator/?title=&amp;description=&amp;type=&amp;credit=&amp;creator=&amp;price=&amp;preview=&amp;type2=&amp;color2split=1&amp;boldkeys=&amp;picture-x=0&amp;picture-y=0&amp;picture-zoom=1&amp;picture=&amp;expansion=&amp;custom-icon=&amp;color0=0&amp;color1=0&amp;size=4">the card generator</a>) and use them with your existing cards. No need for fancy card-stock, matching backs, and all that &#x2013; just print them out and play.
</p>
</div>
</div>

<div id="outline-container-orgda8021d" class="outline-2">
<h2 id="orgda8021d">General Notes</h2>
<div class="outline-text-2" id="text-orgda8021d">
<ul class="org-ul">
<li>Bane cards lay under kingdom piles and grant them new behaviors.</li>
<li>Bane cards that grant a card a new type (e.g. <i>Fortification</i>) do this in addition to its existing types though card types remain</li>
<li>Kingdom cards should have at most one Bane modifier</li>
<li>It's recommended to use no more than 3 Bane cards in a kingdom</li>
</ul>
</div>
</div>

<div id="outline-container-org391c26f" class="outline-2">
<h2 id="org391c26f">Bane Behaviors</h2>
<div class="outline-text-2" id="text-org391c26f">
<p>
Here are the card names and their behaviors.
</p>
</div>

<div id="outline-container-org724637d" class="outline-3">
<h3 id="org724637d">Bargain</h3>
<div class="outline-text-3" id="text-org724637d">
<p>
These cost 1 less than marked but not less than 0.
</p>
</div>
</div>

<div id="outline-container-orgbdd4524" class="outline-3">
<h3 id="orgbdd4524">Buy and Buy</h3>
<div class="outline-text-3" id="text-orgbdd4524">
<p>
When you gain one of these, +1 buy.
</p>
</div>
</div>

<div id="outline-container-org878fd52" class="outline-3">
<h3 id="org878fd52">Cover of Darkness</h3>
<div class="outline-text-3" id="text-org878fd52">
<p>
After you buy one of these, move the top card from any kingdom pile on top of any other kingdom pile.
</p>
</div>
</div>

<div id="outline-container-org5a40aaa" class="outline-3">
<h3 id="org5a40aaa">Cursed Heirloom</h3>
<div class="outline-text-3" id="text-org5a40aaa">
<p>
When you buy one of these each other player gains a curse.
</p>
</div>
</div>

<div id="outline-container-org86e5569" class="outline-3">
<h3 id="org86e5569">Exchange</h3>
<div class="outline-text-3" id="text-org86e5569">
<p>
When you buy one of these, players pass a card from their hand to the next player's hand (simultaneously).
</p>
</div>
</div>

<div id="outline-container-org4e3207d" class="outline-3">
<h3 id="org4e3207d">Flank</h3>
<div class="outline-text-3" id="text-org4e3207d">
<p>
If you have one of these in your hand at the start of your turn, you may discard your hand and redraw it.
</p>

<p>
You draw the same number of cards as you discarded (including the Flank card).
</p>
</div>
</div>

<div id="outline-container-org2d11532" class="outline-3">
<h3 id="org2d11532">Fools Gold</h3>
<div class="outline-text-3" id="text-org2d11532">
<p>
These cannot be purchased using $. You must use a combination of actions and buys instead.
</p>
</div>
</div>

<div id="outline-container-org92cf85d" class="outline-3">
<h3 id="org92cf85d">Fortification</h3>
<div class="outline-text-3" id="text-org92cf85d">
<p>
These may be used as a Reaction with the same defense as Moat (reveal to block any attack).
</p>

<p>
These are now considered a Reaction cards, if not already.
</p>
</div>
</div>

<div id="outline-container-org347823c" class="outline-3">
<h3 id="org347823c">Frontier</h3>
<div class="outline-text-3" id="text-org347823c">
<p>
When you gain one of these you may also gain any other buy-able card in the game that has not yet been gained by a player.
</p>
</div>
</div>

<div id="outline-container-org7ff84eb" class="outline-3">
<h3 id="org7ff84eb">Gambler</h3>
<div class="outline-text-3" id="text-org7ff84eb">
<p>
When you acquire one of these, flip a coin. If heads, gain +$3, if tails, gain a curse.
</p>
</div>
</div>

<div id="outline-container-orgaa691f5" class="outline-3">
<h3 id="orgaa691f5">Magic Shield</h3>
<div class="outline-text-3" id="text-orgaa691f5">
<p>
If you have one of these in hand when you would have been cursed, you may reveal it to instead curse the player who tried to curse you.
</p>

<p>
If they reveal magic shield, you instead trash the curse.
</p>

<p>
These are now considered a Reaction cards, if not already.
</p>
</div>
</div>

<div id="outline-container-orgf8c21ed" class="outline-3">
<h3 id="orgf8c21ed">Opportune</h3>
<div class="outline-text-3" id="text-orgf8c21ed">
<p>
When played as actions, these give +1 action, +1 card before its listed affects.
</p>

<p>
These are now considered a Action cards, if not already.
</p>
</div>
</div>

<div id="outline-container-orgf45af40" class="outline-3">
<h3 id="orgf45af40">Plague Cart</h3>
<div class="outline-text-3" id="text-orgf45af40">
<p>
When you buy one of these, name a card. All other players must trash that card or reveal that they cannot.
</p>
</div>
</div>

<div id="outline-container-org1e2ab87" class="outline-3">
<h3 id="org1e2ab87">Rebate</h3>
<div class="outline-text-3" id="text-org1e2ab87">
<p>
When you gain one of these, +$1.
</p>
</div>
</div>

<div id="outline-container-org5eaafe6" class="outline-3">
<h3 id="org5eaafe6">Sacrifice</h3>
<div class="outline-text-3" id="text-org5eaafe6">
<p>
When you gain one of these, trash a card from another kingdom pile of equal or lesser value.
</p>
</div>
</div>

<div id="outline-container-org890a0d4" class="outline-3">
<h3 id="org890a0d4">Secret Plans</h3>
<div class="outline-text-3" id="text-org890a0d4">
<p>
These are also worth 1VP.
</p>

<p>
These are now considered a Victory cards, if not already.
</p>
</div>
</div>

<div id="outline-container-org1724c1c" class="outline-3">
<h3 id="org1724c1c">Silver Mine</h3>
<div class="outline-text-3" id="text-org1724c1c">
<p>
When you gain one of these, also gain a silver.
</p>
</div>
</div>

<div id="outline-container-org1c273ed" class="outline-3">
<h3 id="org1c273ed">Throne</h3>
<div class="outline-text-3" id="text-org1c273ed">
<p>
These behave as if they were Throne Roomed when playing them as actions.
</p>
</div>
</div>

<div id="outline-container-org5db3441" class="outline-3">
<h3 id="org5db3441">Treasury Key</h3>
<div class="outline-text-3" id="text-org5db3441">
<p>
If you cause this pile to be depleted, gain 6 golds.    
</p>
</div>
</div>

<div id="outline-container-orgb46fe5d" class="outline-3">
<h3 id="orgb46fe5d">Tunnel</h3>
<div class="outline-text-3" id="text-orgb46fe5d">
<p>
These are gained directly to your deck instead of discard pile.
</p>
</div>
</div>

<div id="outline-container-orgc5a33ae" class="outline-3">
<h3 id="orgc5a33ae">Vault</h3>
<div class="outline-text-3" id="text-orgc5a33ae">
<p>
When you gain one of these, set aside another card from your hand. When you finish your turn, put the set aside card into your new hand.
</p>
</div>
</div>

<div id="outline-container-org58660b8" class="outline-3">
<h3 id="org58660b8">Zebra</h3>
<div class="outline-text-3" id="text-org58660b8">
<p>
This pile is comprised half of one pile of kingdom cards shuffled with another half pile.
</p>

<p>
The kingdom cards and top card are known but the order is secret.
</p>
</div>
</div>
</div>
<div class="taglist"><a href="https://mjgpy3.github.io/me/tags.html">Tags</a>: <a href="https://mjgpy3.github.io/me/tag-dominion.html">dominion</a> <a href="https://mjgpy3.github.io/me/tag-project.html">project</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
